Repository: 0-artnoc/TranslatorApk
Catalog: Resources/Localizations/StringResources.*.resx
Languages: be_by, vi_vn

# AboutProgram
source: About
be_by: Пра праграму
vi_vn: Về

source: All .smali
be_by: Усе .smali
vi_vn: Smali tất cả.

source: All .xml
be_by: Усе .xml
vi_vn: Tất cả xml.

source: Android apps
be_by: Дадаткі Андроід
vi_vn: Ứng dụng Android

source: Build project
be_by: Скампіляваць праект
vi_vn: Xây dựng dự án

# CantTranslate
source: Error was occurred while translating!
be_by: Памылка падчас перакладу!
vi_vn: Xảy ra lỗi trong khi dịch!

source: Choose cell or row!
be_by: Абярыце ячэйку альбо радок!
vi_vn: Chọn di động hoặc hàng!

source: Choose file
be_by: Абраць файл
vi_vn: Chọn tập tin

source: Choose folder
be_by: Абраць каталог
vi_vn: Chọn thư mục

source: Collapse
be_by: Згарнуць
vi_vn: Thu hẹp

source: Confirmation
be_by: Пацверджанне
vi_vn: Xác nhận

source: Current dictionary
be_by: Бягучы слоўнік
vi_vn: Hiện tại từ điển

source: Delete
be_by: Выдаліць
vi_vn: Xóa

source: Dictionary
be_by: Слоўнік
vi_vn: Từ điển

source: Editor
be_by: Рэдактар
vi_vn: Biên tập viên

source: Empty smali
be_by: Пустыя smali
vi_vn: Rỗng smali

source: Empty xml
be_by: Пустыя xml
vi_vn: Sản phẩm nào xml

# ErrorLower
source: Error
be_by: Памылка
vi_vn: Lỗi

# ErrorUpper
source: ERROR
be_by: ПАМЫЛКА
vi_vn: LỖI

source: Error while compiling!
be_by: Памылка падчас кампіляцыі!
vi_vn: Lỗi trong khi biên dịch!

source: Error while signing!
be_by: Памылка падчас падпісвання!
vi_vn: Lỗi khi đăng!

source: Expand
be_by: Разгарнуць
vi_vn: Mở rộng

source: File is situated in
be_by: Файл знаходзіцца ў
vi_vn: Tập tin nằm ở

source: Filename
be_by: Назва файла
vi_vn: Tên tập tin

source: Files with errors
be_by: Файлы з памылкамі
vi_vn: Các tập tin với lỗi

source: Find
be_by: Знайсці
vi_vn: Tìm thấy

source: Find all
be_by: Знайсці ўсе
vi_vn: Tìm thấy tất cả

source: Find next
be_by: Шукаць далей
vi_vn: Tìm tiếp

source: Finished
be_by: Завершана
vi_vn: Hoàn thành

source: from
be_by: з
vi_vn: từ khoản

# ImageExtensions
source: Visible file extensions:
be_by: Пашырэнні выяў:
vi_vn: Tập tin tiện ích mở rộng có thể nhìn thấy:

source: Images
be_by: Выявы
vi_vn: Hình ảnh

source: Language:
be_by: Мова:
vi_vn: Ngôn ngữ:

source: Language of app:
be_by: Мова дадатка:
vi_vn: Ngôn ngữ của các ứng dụng:

source: Match case
be_by: Зважаць на рэгістр
vi_vn: Trận đấu trường hợp

source: Name
be_by: Назва
vi_vn: Tên

source: New text
be_by: Новы тэкст
vi_vn: Văn bản mới

source: No
be_by: Не
vi_vn: Không

# NoInternetCantTranslate
source: Error while connecting to the internet! Online translation is disabled
be_by: Няма злучэння! Немагчыма перакладаць у сеціве
vi_vn: Lỗi trong khi kết nối internet! Dịch trực tuyến bị vô hiệu hóa

source: Old text
be_by: Стары тэкст
vi_vn: Plaintext

source: Online translator:
be_by: Сеціўны пераклад:
vi_vn: Dịch trực tuyến:

# OnlyFullWords
source: Match whole word only
be_by: Толькі поўныя словы
vi_vn: Phù hợp với toàn bộ từ duy nhất

source: Only xml
be_by: Толькі xml
vi_vn: Chỉ xml

source: Open
be_by: Адкрыць
vi_vn: Mở

source: Options
be_by: Параметры
vi_vn: Tùy chọn

source: Other extensions:
be_by: Пашырэнні іншых файлаў:
vi_vn: Phần mở rộng khác:

source: Other files
be_by: Іншыя файлы
vi_vn: Các tập tin

source: Refresh
be_by: Абнавіць
vi_vn: Làm tươi

source: Replace
be_by: Замяніць
vi_vn: Thay thế

# RestartProgramToApplyLanguage
source: Restart program to apply language setting?
be_by: Перезапусціць праграму, каб змяніць мову?
vi_vn: Khởi động lại chương trình để áp dụng cài đặt ngôn ngữ?

source: Save
be_by: Захаваць
vi_vn: Lưu

source: Search
be_by: Пошук
vi_vn: Tìm kiếm

# SearchEditorClosed
source: Editor window was closed. Search will not work
be_by: Акно рэдактара было закрыта. Немагчыма шукаць
vi_vn: Biên tập viên cửa sổ đã đóng. Tìm kiếm sẽ không hoạt động

source: Search options
be_by: Параметры пошуку
vi_vn: Tùy chọn tìm kiếm

source: Settings
be_by: Налады
vi_vn: Cài đặt

source: Sign
be_by: Падпісаць
vi_vn: Dấu hiệu

source: Stop
be_by: Спыніць
vi_vn: Dừng

source: Strings translated:
be_by: Радкоў перакладзена:
vi_vn: Chuỗi dịch xong:

source: Target language
be_by: Мэтавая мова
vi_vn: Ngôn ngữ mục tiêu

source: Text
be_by: Тэкст
vi_vn: Văn bản

# TextNotFound
source: Text is not found
be_by: Мэтавы тэкст не знойдзены
vi_vn: Các văn bản không được tìm thấy

source: Translate all
be_by: Перакласці ўсё
vi_vn: Dịch tất cả

source: Use
be_by: Карыстацца
vi_vn: Sử dụng

source: Version
be_by: Версія
vi_vn: Phiên bản

# WaitingOperation
source: Waiting for completion of the operation...
be_by: Завяршэнне...
vi_vn: Chờ đợi hoàn thành việc....

source: XmlRulesEditor
be_by: Рэдактар правілаў xml

source: Yes
be_by: Так
vi_vn: Có

source: You need to choose dictionary!
be_by: Вы мусіце абраць слоўнік!
vi_vn: Bạn cần phải chọn một từ điển!

source: Dictionary files
be_by: Файлы слоўнікаў
vi_vn: Từ điển tập tin

# DictionariesFolder
source: Folder with dictionaries
be_by: Каталогі са слоўнікамі
vi_vn: Các thư mục với từ điển

# DictionaryFolder
source: Dictionary's folder
be_by: Каталог слоўніка
vi_vn: Từ điển của thư mục

# NamesOfFolderLanguages
source: English (UK)|Arabic|Afrikaans|Belarusian|Bulgarian|Bosnian|Hungarian|Vietnamese|Dutch|Greek|Danish|Zulu|Hebrew|Indonesian|Spanish|Italian|Catalan|Chinese|Chinese (Simplified)|Chinese (Traditional)|Latvian|Lithuanian|Malay|German|Norwegian|Persian|Polish|Portuguese|Romanian|Russian|Serbian|Slovak|Slovenian|Swahili|Tagalog|Thai|Turkish|Ukrainian|Finnish|French|Hindi|Czech|Swedish|Estonian|Japanese
be_by: Англійская (Велікабрытанія)|Арабская|Афрыкаанс|Беларуская|Балгарская|Баснійская|Венгерская|В'етнамская|Галандская|Грэцкая|Дацкая|Зулу|Іўрыт|Іспанская|Італьянская|Каталанская|Кітайская|Кітайская (Спрошчаная)|Кітайская (Традыцыйная)|Латышская|Летувіская|Малайская|Нямецкая|Нарвежская|Персідская|Польская|Партугальская|Румынская|Расійская|Сербская|Славацкая|Славенская|Суахілі|Тагальская|Тайская|Турэцкая|Украінская|Фінская|Француская|Хіндзі|Чэшская|Шведская|Эстонская|Японская

source: Result folder
be_by: Выходны каталог
vi_vn: Thư mục kết quả

source: Source folder
be_by: Зыходны каталог
vi_vn: Thư mục nguồn

source: Start
be_by: Пачаць
vi_vn: Bắt đầu

# TranslatedFolder
source: Folder with translations
be_by: Каталог з перакладам
vi_vn: Các thư mục với bản dịch

source: Add language
be_by: Дадаць мову
vi_vn: Thêm ngôn ngữ

source: Open with
be_by: Адкрыць з дапамогай
vi_vn: Mở với

source: Replace Unicode sequences
be_by: Замяняць паслядоўнасць Юнікоду
vi_vn: Thay thế trình tự Unicode

source: Changes detector
be_by: Выяўленне змен
vi_vn: Thay đổi phát hiện

source: Api key is empty
be_by: Ключ Api пусты
vi_vn: Khóa API là sản phẩm nào

source: Api key:
be_by: Ключ api:
vi_vn: Khóa API:

source: Load with text strings
be_by: Загрузіць з тэкставымі радкамі
vi_vn: Tải với các chuỗi ký tự

source: Only resources
be_by: Толькі рэсурсы
vi_vn: Chỉ tài nguyên

source: Show in explorer
be_by: Паказаць у правадніку
vi_vn: Hiển thị trong explorer

source: Add
be_by: Дадаць
vi_vn: Thêm

source: New language:
be_by: Новая мова:
vi_vn: Ngôn ngữ mới:

source: Can't update program
be_by: Не атрымалася абнавіць праграму
vi_vn: Không thể cập nhật chương trình

source: Update
be_by: Абнавіць
vi_vn: Cập Nhật

# UpdateNewVersion
source: New version is available. Update?
be_by: Даступна новая версія. Абнавіць?
vi_vn: Phiên bản mới có sẵn. Cập Nhật?

# Theme_Dark
source: Dark
be_by: Цёмнае
vi_vn: Tối

# Theme_Light
source: Light
be_by: Светлае
vi_vn: Ánh sáng

source: Apktool version:
be_by: Версія apktool:
vi_vn: Phiên bản Apktool:

source: Theme:
be_by: Аздабленне:
vi_vn: Chủ đề:

source: Xml files
be_by: Файлы xml
vi_vn: Tập tin XML

# AccountNumberIsCopied
source: Account number is copied to the clipboard
be_by: Нумар рахунка скапіраваны ў буфер абмену
vi_vn: Số tài khoản được sao chép vào clipboard

source: Language is not selected!
be_by: Не выбрана мова!
vi_vn: Ngôn ngữ không được chọn!

source: All done!
be_by: Завершана!
vi_vn: Tất cả được thực hiện!

source: Apply the changes?
be_by: Ужыць змены?
vi_vn: Áp dụng những thay đổi?

source: Cancel
be_by: Скасаваць
vi_vn: Hủy bỏ

# ChangesDetectorWindow_OneFileTranslation
source: One file translation
be_by: Переклад аднаго файла
vi_vn: Một tập tin bản dịch

# ChangesDetectorWindow_OneFileTranslation_ToolTip
source: One file translation with dictionary
be_by: Пераклад файла з ужываннем слоўніка
vi_vn: Một tập tin bản dịch với từ điển

# FileDeleteConfirmation
source: Are you really want to delete the file
be_by: Сапраўды хочаце выдаліць файл
vi_vn: Bạn thực sự muốn xóa các tập tin

# FolderDeleteConfirmation
source: Are you really want to delete the folder
be_by: Сапраўды хочаце выдаліць каталог
vi_vn: Bạn thực sự muốn xóa thư mục

source: Select a folder:
be_by: Абярыце каталог:
vi_vn: Chọn một thư mục:

source: The file is corrupted!
be_by: Файл пашкоджаны!
vi_vn: Các tập tin bị hỏng!

# SearchWindow_FolderIsNotSelected
source: You must select a folder to search!
be_by: Вы мусіце абраць каталог , каб пачаць шукаць!
vi_vn: Bạn phải chọn một thư mục để tìm kiếm!

# JavaNotFoundError
source: Java wasn't found! Please, download it from official site or use portable version of program
be_by: Java не знойдзена! Калі ласка, загрузіце яе з афіцыйнага сайта альбо скарыстайцеся партатыўнай версіяй праграмы
vi_vn: Java không tìm thấy! Xin vui lòng, tải nó từ trang web chính thức hoặc sử dụng các phiên bản di động của chương trình

# OnlineTranslationsLongLanguages
source: Albanian|English|Arabic|Armenian|Azerbaijan|Afrikaans|Basque|Belarusian|Bulgarian|Bosnian|Welsh|Vietnamese|Hungarian|Haitian(Creole)|Galician|Dutch|Greek|Georgian|Danish|Yiddish|Indonesian|Irish|Italian|Icelandic|Spanish|Kazakh|Catalan|Kyrgyz|Chinese|Korean|Latin|Latvian|Lithuanian|Malagasy|Malay|Maltese|Macedonian|Mongolian|German|Norwegian|Persian|Polish|Portuguese|Romanian|Russian|Serbian|Slovakian|Slovenian|Swahili|Tajik|Thai|Tagalog|Tatar|Turkish|Uzbek|Ukrainian|Finish|French|Croatian|Czech|Swedish|Estonian|Japanese
be_by: Албанская|Англійская|Арабская|Армянская|Азербайджанская|Африкаанс|Баскская|Беларуская|Балгарская|Баснійская|Уэльская|В'етнамская|Венгерская|Гаіцянская (Крэольская)|Галіцкая|Галандская|Грэцкая|Грузінская|Дацкая|Ідыш|Інданэзійская|Ірландская|італьянская|Ісландская|Іспанскач|Казахская|Каталанская|Кыргыская|Кітайская|Карэйская|Лацінская|Латышская|Летувіская|Малагасійская|Малайская|МальційскаяМакедонская|Мангольская|Нямецкая|Нарвеская|Персідская|Польская|Партугальская|Румынская|Расійская|Сербская|Славацкая|Славенская|Суахілі|Таджыкская|Тайская|Тагальская|Татарская|Турэцкая|Узбекская|Украінская|Фінская|Француская|Харвацкая|Чэская|Швецкая|Эстонская|Японская
vi_vn: Albanian|English|Arabic|Armenia|Azerbaijan|Afrikaans|Basque|Belarus|Bulgaria|Bosnia|Welsh|TiếngViệt|Hungary|Haiti (Creole)|Galician|HàLan|HyLạp|Gruzia|ĐanMạch|Yiddish|Indonesia|Irish|Ý|Iceland|TâyBanNha|Kazakhstan|Catalan|Kyrgyzstan|TrungQuốc|HànQuốc|Latin|latvian|Lithuania|Malagasy|Malay|Maltese|Macedonian|MôngCổ|Đức|NaUy|BaTư|BaLan|BồĐàoNha|Rumani|Nga|Serbia|Slovakia|Slovenia|Swahili|Tajik|TháiLan|Tagalog|Tatar|ThổNhĩKỳ|Uzbek|Ukraina|Phần Lan|Pháp|Croatia|CộnghòaSéc|ThụyĐiển|Estonian|NgườiNhậtBản

source: Open in explorer
be_by: Адкрыць у правадніку/value> </data> <data name="ShowPreview" xml:space="preserve"> <value>Адлюстроўваць мініяцюры выяў:
vi_vn: Mở trong explorer

source: Show preview:
be_by: Паказваць мініяцюры выяў
vi_vn: Hiện xem trước:

source: Catalog
be_by: Каталог
vi_vn: Danh mục

source: Install
be_by: Усталяваць
vi_vn: Cài đặt

source: Installed
be_by: Усталявана
vi_vn: Cài đặt

source: Description
be_by: Апісанне
vi_vn: Mô tả

source: Title
be_by: Назва
vi_vn: Tiêu đề

source: Plugins
be_by: Убудовы

# ApktoolNotFound
source: Apktool is not found! Please, download apktool to "Files\Resources\apktools"
be_by: Apktool не знойдзены! Калі ласка, скапіруйце apktool у "Files\Resources\apktools"
vi_vn: Apktool không được tìm thấy! Xin vui lòng, tải apktool để "Files\Resources\apktools"

source: Empty folders
be_by: Пустыя каталогі
vi_vn: Thư mục rỗng

# TopMost
source: On top of all windows:
be_by: Наверсе:

source: Size
be_by: Памер
vi_vn: Kích thước

source: Uninstall
be_by: Выдаліць
vi_vn: Gỡ bỏ cài đặt

# ChangesDetectorWindow_ManyFilesCreation
source: Many files creation
be_by: Стварэнне некалькіх файлаў
vi_vn: Nhiều tác phẩm sáng tạo

# ChangesDetectorWindow_ManyFilesTranslation
source: Many files translation
be_by: Пераклад некалькіх
vi_vn: Nhiều tác phẩm dịch thuật

# ChangesDetectorWindow_OneFileCreation
source: One file creation
be_by: Стварэнне аднаго
vi_vn: Tạo một tập tin

source: Latest version
be_by: Апошняя версія
vi_vn: Phiên bản mới nhất

source: Alternative editing keys:
be_by: Альтэрнатыўныя клавішы редагавання:
vi_vn: Thay thế các phím chỉnh sửa:

# SessionAutoTranslation
source: Auto translation with session dictionary:
be_by: Аўтаматычны пераклад з ужываннем слоўніка сеансу:
vi_vn: Tự động dịch thuật với phiên giao dịch từ điển:

source: Save and exit
be_by: Захаваць і выйсці
vi_vn: Lưu và thoát ra

# CanNotRecievePluginsList
source: Can not recieve plugins list. Please, check your internet connection.
be_by: Немагчыма атрымаць спіс убудоў. Калі ласка, праверце злучэнне.
vi_vn: Không thể nhận được danh sách bổ sung. Xin vui lòng, hãy kiểm tra kết nối internet của bạn.

# CanNotRecieveApktoolsList
source: Can not recieve apktools list. Please, check your internet connection.
be_by: Немагчыма атрымаць спіс версій apktools. Калі ласка, праверце злучэнне.
vi_vn: Không thể nhận được danh sách apktools. Xin vui lòng, hãy kiểm tra kết nối internet của bạn.

source: Directory path (to clipboard)
be_by: Шлях да каталога файла (у буфер абмену)
vi_vn: Đường dẫn thư mục (vào clipboard)

source: File name (to clipboard)
be_by: Назва файла (у буфер абмену)
vi_vn: Tên tập tin (vào clipboard)

source: Full file path (to clipboard)
be_by: Шлях да файла цалкам (у буфер абмену)
vi_vn: Đường dẫn tệp đầy đủ (vào clipboard)

source: Loading...
be_by: Загрузка...
vi_vn: Đang tải...

source: Copy
be_by: Скапіраваць
vi_vn: Sao chép

source: Paste
be_by: Уставіць
vi_vn: Dán

source: Show notifications:
be_by: Паказваць апавяшчэнні:
vi_vn: Hiển thị thông báo:

source: Compilation finished
be_by: Кампіляцыя завершана
vi_vn: Trình biên dịch đã hoàn thành

source: Decompilation finished
be_by: Дэкампіляцыя завершана
vi_vn: Decompilation đã hoàn thành

source: The following files have been already added
be_by: Гэтыя файлы ўжо дададзеныя
vi_vn: Các tập tin đã được thêm vào đã

source: Information
be_by: Інфармацыя
vi_vn: Thông tin

source: Alternate rows in editor
be_by: Чаргуючыяся радкі ў рэдактары
vi_vn: Thay thế hàng trong trình soạn thảo

source: Clear
be_by: Ачысціць
vi_vn: Xóa

# FileIsInUse
source: The file may be in use (and thus locked) by another user or application: "{0}"
be_by: Наступны файл ужо выкарыстоўваецца іншым карыстальнікам альбо праграмай: "{0}"

# StringEditorWindow_NextStringLabel
source: Next
be_by: Наступная
vi_vn: Tiếp theo

# StringEditorWindow_PreviousStringLabel
source: Previous
be_by: Папярэдняя
vi_vn: Trước

# Dictionaries_Label
source: Dictionaries
be_by: Слоўнікі
vi_vn: Từ điển

# TranslationTimeout_Label
source: Translation timeout:
be_by: Сыйшоў час перакладу:
